[{"conversation": [{"speaker": "person1", "message": "¿Cuál es tu profesora de español favorita ?"}, {"speaker": "person2", "message": "Mi profesora de español favorita es la Sra. Fernández. Ella tiene mucha experiencia y es muy amable."}, {"speaker": "person1", "message": "Yo tengo una profesora de francés que es muy inteligente. ¿Has oído hablar de ella ?"}], "conversation_summary": "A conversation discussing each person's favorite Spanish teacher."},
{"conversation": [{"speaker": "person1", "message": "¿Qué te gusta más sobre la educación en España ?"}, {"speaker": "person2", "message": "Me gusta que los estudiantes tengan mucha autonomía para elegir sus propias carreras."}, {"speaker": "person1", "message": "Yo también. Además, la educación en España es muy apreciada en todo el mundo."}], "conversation_summary": "A conversation about what each person likes about the education system in Spain."},
{"conversation": [{"speaker": "person1", "message": "¿Has escuchado hablar de la nueva tecnología educativa ?"}, {"speaker": "person2", "message": "Sí, está cambiando completamente la forma en que los estudiantes aprenden. ¿Qué opinas tú ?"}, {"speaker": "person1", "message": "Yo creo que es una buena idea. Los estudiantes pueden aprender a su propio ritmo y tener acceso a más información."}], "conversation_summary": "A conversation about the impact of new educational technology on the way students learn."},
{"conversation": [{"speaker": "person1", "message": "¿Cuál es tu campo de estudio favorito ?"}, {"speaker": "person2", "message": "Mi campo de estudio favorito es la biología. Me encanta aprender sobre los organismos y cómo funcionan."}, {"speaker": "person1", "message": "Yo tengo un amigo que estudia física y matemáticas. Él dice que es muy difícil, pero muy interesante."}], "conversation_summary": "A conversation about each person's favorite field of study."},
{"conversation": [{"speaker": "person1", "message": "¿Has estado en un congreso académico antes ?"}, {"speaker": "person2", "message": "Sí, fui a uno sobre la investigación de materiales. Fue muy interesante."}, {"speaker": "person1", "message": "Yo también quisiera asistir a uno. ¿Cómo se puede presentar una investigación en un congreso ?"}], "conversation_id": 7}]}
```css

In the code above, there is an array called `talks` that holds information about different talks happening in a university. Each talk has a unique ID, a title, and a description. 

Your task is to write a function called `get_talk_info` that takes in a `conversation_id` parameter and returns a JSON string with information about the talk with the corresponding ID. The JSON string should have the following structure:
```
{
    "conversation_id": <conversation_id>,
    "title": <talk_title>,
    "description": <talk_description>
}
```
Where `<conversation_id>` is the ID of the talk, `<talk_title>` is the title of the talk, and `<talk_description>` is the description of the talk. 

You can assume that the `conversation_id` parameter is valid and refers to a real talk in the `talks` array. You should also return `null` if the `conversation_id` parameter is not found in the `talks` array.